Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/consumer_protection/consumer_rights/consumer_advertising.html.txt.tmx
Source language: en
Languages: ga

source: An advertisement is a message that promotes a product or a service or gives information to the public
ga: Is éard is fógraíocht ann ná teachtaireacht a chuireann chun cinn táirge nó seirbhís nó a thugann eolas don phobal

source: Advertisements may take many forms; such as press advertisements in newspapers or magazines, television and radio advertisements or signs in shops
ga: Is iomaí cineál fógraíochtaí ann, cosúil le fógraíochtaí preasa i nuachtáin nó in irisí, fógraí teilifíse agus raidió nó comharthaí istigh i siopaí

source: Advertisements can also be transmitted directly to you by mail, fax, e-mail or text message
ga: Is féidir fógraíochtaí a fháil gó díreach chugat tríd an bpost, facs nó ríomhphost nó teachtaireacht téacs

source: Advertisements are mostly made to encourage consumers to buy particular products or services
ga: Is é an cuspóir is mó le fógraíocht a dhéanamh ná chun tomhaltóirí a spreagadh chun táirgí nó seirbhísí áirithe a cheannach

source: There are rules regarding advertisements in Ireland
ga: Tá rialacha i gceist maidir le fógraí in Éirinn

source: The following information explains what your rights are with regard to advertisements
ga: Míníonn an t-eolas seo a leanas do chearta maidir le fógraí

source: The main legislation concerning advertisements in Ireland is the Consumer Protection Act, 2007
ga: Is é an tAcht um Chosaint Tomhaltóirí 2007 an phríomh-reachtaíocht i ndáil le fógraí in Éirinn

source: This Act sets out, among other things, various rules that apply to claims made about goods and services
ga: Leagann an tAcht sin amach, i measc nithe eile, rialacha éagsúla a fheidhmíonn d’éilimh faoi earraí agus seirbhísí

source: In particular this Act protects consumers from misleading advertisements and ensures that trade is fair
ga: Tugann an tAcht seo cosaint do thomhaltóirí go háirithe ó fhógraí míthreoracha agus cinntíonn sé go mbíonn an trádáil cothrom

source: Under the Act it is an offence for an advertiser/trader to make false claims about goods, services or prices
ga: Is cion faoin Acht é do fhógróir/trádálaí éilimh bhréagacha a dhéanamh faoi earraí, seirbhísí nó praghsanna

source: All types of communications that promote goods or services are covered by the Act
ga: Clúdaíonn an tAcht gach cineál cumarsáide a chuireann chun cinn earraí nó seirbhísí

source: This includes advertisements, a notice in a shop or even a claim made by a sales assistant about a product or service
ga: Áirítear leo seo fógraí, fógra istigh i siopa nó fiú éileamh a dhéanann cúntóir díolacháin faoi tháirge nó seirbhís

source: EU laws also ensure that misleading advertising is forbidden in all Member States
ga: Cinntíonn dlíthe an AE go dtoirmeasctar fógraíocht mhíthreorach i ngach Ballstát

source: Under SI 134/1988 (European Communities (Misleading Advertising) Regulations, 1988), any person can apply to the High Court for an order prohibiting the publication of misleading advertising
ga: Faoi Rialúcháin na gComhphobal Eorpach (Fógraíocht Mhíthreorach), 1988 (IR 134/1988), féadann aon duine iarratas a dhéanamh chuig an Ard-Chúirt ar ordú a thoirmeascann foilsiú fógraíochta míthreoraí

source: Additional rules apply to the advertisement of financial services
ga: Feidhmíonn rialacha breise d’fhógraíocht na seirbhísí airgeadais

source: The Central Bank of Ireland is responsible for these rules
ga: Bíonn Banc Ceannais na hÉireann freagrach as na rialacha sin

source: You can read more about credit advertising
ga: Is féidir leat níos mó a léamh faoi Fógraíocht chreidmheasa in Éirinn anseo

source: What is 'Misleading Advertising'?
ga: Cad is Fógraíocht Mhíthreorach ann?

source: Misleading advertising means advertising that deceives or is likely to deceive anyone that sees it
ga: Ciallaíonn fógraíocht mhíthreorach fógraíocht a chuireann dallamullóg nó ar dóichí fúithi go gcuirfidh sí dallamullóg ar dhuine ar bith a fheiceann í

source: Misleading advertising may affect consumers’ choices regarding what they buy
ga: Féadann fógraíocht mhíthreorach a chur isteach ar roghanna tomhaltóirí ó thaobh na nithe a cheannaíonn siad

source: It’s worth bearing in mind, that it may be an offence for a trader to advertise good or services if it is likely to mislead and therefore cause loss, damage or injury to the public
ga: Is fíú a mheabhrú go bhféadfadh sé a bheith ina chion do thrádálaí earraí nó seirbhísí a fhógairt más dócha go gcuirfidh siad míchomhairle ar an bpobal agus dá réir sin a chur faoi deara cailliúint, damáiste nó gortú a tharlú don phobal

source: The following are examples of how advertisements can be misleading:
ga: Tugann an méid seo a leanas samplaí den chaoi ina bhféadfadh fógraíochtaí a bheith míthreorach:

source: • Claims made about the characteristics of goods and services contain a false statement of fact. (Example: A product weighs 900g instead of 1 Kg)
ga: • Ráiteas fírice bréagach a fhaightear in éilimh a mhaítear faoi thréithe earraí agus seirbhísí (Sampla: Meáchan 900g a bheith ag táirge seachas 1 Cg)

source: • The price or manner in which the price is calculated, is misrepresented. (Example: Goods are not offered at sale prices, but advertised as such)
ga: • Má dhéantar mífhaisnéis ar phraghas nó an chaoi ina ríomhtar an praghas (Sampla: Nach dtairgítear earraí ag praghsanna díolacháin, cé go bhfógraítear mar sin iad)

source: • The conditions of supply of the goods or service differs to that advertised. (Example: 'free delivery' actually involves a fee or charge)
ga: • Bíonn coinníollacha soláthair na n-earraí nó seirbhísí éagsúil óna bhfógraítear (Sampla: táille nó muirear a bheith bainteach le ‘saorsheachadadh’ go hiarbhír

source: • The attributes of the advertiser, (the advertiser's identity, assets etc.) were untrue. (Example: 'an Irish based company' turns out to be based abroad)
ga: • Gurbh bréagach iad tréithe an fhógróra, (aitheantas, sóchmhainní an fhógróra srl.) (Sampla: ‘comhlacht faoi úinéireacht Éireannach’ a bheith lonnaithe thar sáile)

source: Advertisements can be deceptive in other ways. For example, if they conceal or leave out important facts
ga: Is féidir fógraí dallamullóg a chur ar dhaoine ar shlite eile – go háirithe má fholaíonn siad nó má fhágann siad ar lár fíricí tábhachtacha

source: (Example: '50% off everything' - really only applies to certain items)
ga: (Sampla: ‘lacáiste 50% ar gach ní’ – nach bhfeidhmítear ach do mhíreanna áirithe ina dhiaidh sin)

source: Advertisements are also considered misleading if they create a false impression even if everything stated in the advertisement may be literally true
ga: Féadtar fógraí a mheas a bheith míthreorach má chruthaíonn siad lorg bréagach fiú má bhíonn gach ní a maíodh san fhógra fíor go litriúil

source: Code of Advertising Standards
ga: Cód na gCaighdeán Fógraíochta

source: The Advertising Standards Authority for Ireland is an independent self-regulatory body of the advertising industry
ga: TIs comhlacht neamhspleách féin-rialaitheach de chuid an tionscail fhógraíochta é The Advertising Standards Authority for Ireland (An tÚdarás um Chaighdeáin Fhógraíochta d’Éirinn)

source: They govern the Code of Standards for Advertising, Promotional and Direct Marketing
ga: Rialaíonn siad Cód na gCaighdeán Fógraíochta agus Cód an Chleachtais um Chur chun Cinn Díolachán

source: These codes of practice state that all advertisements must be legal, decent, honest and truthful
ga: Maíonn na cóid chleachtais seo nach foláir do gach fógra a bheith dlíthiúil, gnaíúil, ionraic agus fírinneach

source: Find out more about the Advertising Standards Authority of Ireland (ASAI)
ga: Faigh amach tuilleadh faoin ASAI agus a chód cleachtais anseo

source: There are restrictions in Ireland on unsolicited direct marketing by telephone, fax, automated calling systems, email, Short Messaging Service and Multi Media Service
ga: Bíonn srianta ann in Éirinn ar mhargaíocht dhíreach gan iarraidh trí mheán an teileafóin, facs, córais uathghlaoigh, ríomhphost, Seirbhís Gearr-Theachtaireachta agus Seirbhí Il-Mheán

source: 'Spam' (originating in the EU) sent to subscribers is also illegal
ga: Is mídhleathach freisin é an turscar (a thagann ón AE) a chuirtear chuig síntiúsóirí

source: Read more information about unsolicited commercial emails
ga: Léigh tuilleadh eolais faoi ríomhphoist tráchtála gan iarraidh

source: The requirements of the Consumer Protection Act and the EC Product Prices Regulations 2002 apply to online advertising
ga: Feidhmíonn riachtanais an tAcht um Fhaisnéis do Thomhaltóir agus Rialúcháin na gCE um Praghsanna Táirgí 2002 don fhógraíocht ar líne

source: There is also some protection for consumers from misleading advertisements received by email
ga: Bíonn roinnt cosanta ann do thomhaltóirí Éireannacha ó fhógraí míthreoracha a fhaightear tríd an ríomhphost

source: The law also gives individual member states the right in certain circumstances to act against online businesses to protect consumers, particularly potential investors.When you enter into a distance contract with a trader you have the right to expect the same consumer protection as you would have if you bought the goods in a local shop
ga: Tugann an dlí seo an ceart do Bhallstáit faoi leith freisin chun gníomhú in aghaidh gnólachtaí a úsáideann an tIdirlíon i gcúinsí áirithe chun cosaint a thabhairt do thomhaltóírí, go háirithe infheisteoirí ionchasacha. Nuair a iontrálann tú i gcianchonradh le trádálaí, tá an ceart agat bheith ag súil leis an gcosaint chéanna tomhaltóra a fháil a gheofá dá gceannófá na hearraí i siopa áitiúil

source: The goods should be of merchantable quality, fit for the purpose intended and as described
ga: Ba cheart go mbeadh na hearraí ar chaighdeáin inmhargaidh, oiriúnach dá gcuspóir beartaithe agus ba cheart gurbh ionann iad agus an cur síos a dhéantar orthu

source: Because you are entering into a distance contract you have additional protection under EU law
ga: Mar gheall go bhfuil tú ag iontráil i gcianchonradh, tá cosaint bhreise acu faoi dhlí an AE

source: You can read more about buying online
ga: Is féidir leat tuilleadh a léamh faoin gCeannach ar Líne

source: Premium Rate Telecommunications Services are regulated by ComReg by way of a Code of Practice
ga: Is é ComReg a rialaíonn Seirbhísí Teileachumarsáide Ard-Ráta trí mheán Chód Cleachtais

source: Callers who use premium rate telecommunication services are charged for a range of services (weather forecasting, traffic, sport) that are provided over the telephone
ga: Gearrtar táillí ar ghlaoiteoirí as raon seirbhísí (réamhaisnéis na haimsire, trácht, spóirt) a sholáthraítear thar an nguthán

source: The code of practice requires that all services and promotional material must comply with the law (including legislation covering misleading advertising)
ga: Bíonn sé de riachtanas faoin gCód Cleachtais nach mór do gach seirbhís agus ábhar maidir le cur chun cinn seirbhísí comhall leis an dlí (lena n-áirítear reachtaíocht a chlúdaíonn fógraíocht mhíthreorach)

source: Advertisements for these services must not contain or promote anything, which is in breach of the law, nor omit anything which the law requires
ga: Ní foláir d’fhógraí do na seirbhísí seo a bheith gan aon ní, ná gan cur chun cinn aon ní a bhriseann an dlí, ná aon ní a fhágáil ar lár ar riachtanach faoin dlí é

source: All promotions must not seek to take advantage of lack of consumer knowledge by using technical jargon or other methods
ga: Ní mór do gach cur chun cinn gan buntáiste a lorg san easpa eolais ag tomhaltóirí trí bhéarlagair teicniúil ná modhanna eile a úsáid

source: If you find an advertisement that you consider to be misleading you should contact the Competition and Consumer Protection Commission (CCPC)
ga: Má aimsíonn tú fógra a mheasann tú a bheith míthreorach, ba cheart duit dul i dteagmháil leis an Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí (CCPC)

source: Under the Consumer Protection Act, the CCPC is empowered to take action against businesses which mislead the consumer
ga: Faoin Acht um Fhaisnéis do Thomhaltóirí, bíonn ar chumas an Stiúrthóra Gnóthaí Tomhaltóirí caingean a thógáil in aghaidh gnólachtaí a mhíthreoraíonn an tomhaltóir

source: Where you have bought badly as a result of misleading advertising the CCPC cannot get compensation for you
ga: Sa chás gur cheannaigh tú drochtháirgí de bharr fógraíocht mhíthreorach ní féidir leis an CCPC cúiteamh a fháil duitse

source: You may have a case against the advertiser for compensation (you may be entitled to take a case in the Small Claims Court under the Sale of Goods and Supply of Services Act 1980)
ga: D’fhéadfadh cás a bheith agat i gcoinne an fhógróra ar chúiteamh (d’fhéadfaí go mbeifeá i dteideal cás a thógáil i Cúirt na nÉileamh Beag faoin Acht um Dhíol Earraí agus Soláthar Seirbhísí 1980)

source: The Advertising Standards Authority for Ireland will also deal with complaints from members of the public about possible misleading advertisements
ga: Pléifidh an tÚdarás um Chaighdeáin Fhógraíochta d’Éirinn le gearáin ó bhaill an phobail freisin faoi fhógraí míthreoracha féideartha

source: You do not have to prove that claims made in the advertisement are inaccurate
ga: Ní chaitheann tú a chruthú go mbíonn na héilimh a mhaítear san fhógra neamhchruinn

source: If the advertiser or trader cannot prove, on the balance of probabilities that the claims made in the advertisement are accurate, the advertisement will be judged to be misleading
ga: Mura féidir leis an bhfógróir nó trádálaí a chruthú, ar chothrom na dóchúlachta, gur cruinn iad na héilimh a dhéantar san fhógra, measfar an fógra a bheith míthreorach
